Revit 2024 API
PlanTopologySet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	PlanTopology item
)
Visual Basic
Public Overridable Function Erase ( _
	item As PlanTopology _
) As Integer
Visual C++
public:
virtual int Erase(
	PlanTopology^ item
)
Parameters
item
Type: Autodesk.Revit.DB.PlanTopology
The item to be erased.
Return Value
The number of items that were erased from the set.
See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace